# =================================================================================#
#                               コードを変換する為の関数                           #
# =================================================================================#


# 予約時間
def GetReserveTime(num):
    if num == "1":
        time = "0903"
    elif num == "2":
        time = "1203"
    elif num == "3":
        time = "1503"
    elif num == "4":
        time = "1803"
    else:
        time = "-1"
    
    return time


# 予約コード
def GetYoyakuCode(code):
    forward = code[20:23]
    backward = code[24:28]
    
    if forward == "001" and backward == "001":
        status = "_0_1_1_"
    elif forward == "002" and backward == "002":
        status = "_0_0_1_"
    elif forward == "002" and backward == "001":
        status = "_1_0_1_"
    else:
        status = "-1"
    
    return status


# 体育館のコード取得
def GetGymCode(num):
    if num == "01":
        # 丸善インテックアリーナ大阪（中央体育館）  サブアリーナ１／２面
        code = "271004_001_01_02_02_002_002"
    elif num == "02":
        # 千島体育館  体育場１／２面
        code = "271004_001_02_01_02_001_002"
    elif num == "03":
        # フィットネス２１東淀川体育館  体育場１／２面
        code = "271004_001_03_01_02_001_002"
    elif num == "04":
        # 北スポーツセンター  第１体育場
        code = "271004_001_13_01_01_001_001"
    elif num == "05":
        # 都島スポーツセンター  第１体育場
        code = "271004_001_14_01_01_001_001"
    elif num == "06":
        # 都島スポーツセンター  第２体育場
        code = "271004_001_14_02_01_002_001"
    elif num == "07":
        # 福島スポーツセンター  体育場
        code = "271004_001_15_01_01_001_001"
    elif num == "08":
        # フィットネス２１此花スポーツセンター  第１体育場
        code = "271004_001_16_01_01_001_001"
    elif num == "09":
        # 中央スポーツセンター  第１体育場
        code = "271004_001_17_01_01_001_001"
    elif num == "10":
        # 西スポーツセンター  第１体育場
        code = "271004_001_18_01_01_001_001"
    elif num == "11":
        # 港スポーツセンター  第１体育場１／２面
        code = "271004_001_19_01_01_001_001"
    elif num == "12":
        # 港スポーツセンター  第２体育場
        code = "271004_001_19_02_01_002_001"
    elif num == "13":
        # 大正スポーツセンター  第１体育場１／２面
        code = "271004_001_20_01_01_001_001"
    elif num == "14":
        # 大正スポーツセンター  第２体育場
        code = "271004_001_20_02_01_002_001"
    elif num == "15":
        # 天王寺スポーツセンター  第１体育場１／２面
        code = "271004_001_21_01_01_001_001"
    elif num == "16":
        # 天王寺スポーツセンター  第２体育場
        code = "271004_001_21_02_01_002_001"
    elif num == "17":
        # 明治スポーツプラザ浪速スポーツセンター  第１体育場１／２面
        code = "271004_001_22_01_01_001_001"
    elif num == "18":
        # 明治スポーツプラザ浪速スポーツセンター  第２体育場
        code = "271004_001_22_02_01_002_001"
    elif num == "19":
        # サンエイワーク西淀川スポーツセンター  体育場
        code = "271004_001_23_01_01_001_001"
    elif num == "20":
        # 淀川スポーツセンター  第１体育場
        code = "271004_001_24_01_01_001_001"
    elif num == "21":
        # 淀川スポーツセンター  第２体育場
        code = "271004_001_24_02_01_002_001"
    elif num == "22":
        # 東淀川スポーツセンター  第１体育場１／２面
        code = "271004_001_25_01_01_001_001"
    elif num == "23":
        # 東成スポーツセンター  第１体育場１／２面
        code = "271004_001_26_01_01_001_001"
    elif num == "24":
        # 東成スポーツセンター  第２体育場
        code = "271004_001_26_02_01_002_001"
    elif num == "25":
        # 生野スポーツセンター  第１体育場
        code = "271004_001_27_01_01_001_001"
    elif num == "26":
        # 旭スポーツセンター  第１体育場
        code = "271004_001_28_01_01_001_001"
    elif num == "27":
        # 城東スポーツセンター  第１体育場１／２面
        code = "271004_001_29_01_01_001_001"
    elif num == "28":
        # 城東スポーツセンター  第２体育場
        code = "271004_001_29_02_01_002_001"
    elif num == "29":
        # 鶴見スポーツセンター  第１体育場
        code = "271004_001_30_01_01_001_001"
    elif num == "30":
        # サンエイワーク阿倍野スポーツセンター  第１体育場１／２面
        code = "271004_001_31_01_01_001_001"
    elif num == "31":
        # 住之江スポーツセンター  第１体育場
        code = "271004_001_32_01_01_001_001"
    elif num == "32":
        # サンエイワーク住吉スポーツセンター  第１体育場１／２面
        code = "271004_001_33_01_01_001_001"
    elif num == "33":
        # 東住吉スポーツセンター  第１体育場１／２面
        code = "271004_001_34_01_01_001_001"
    elif num == "34":
        # ＨＳＴ平野スポーツセンター  第１体育場１／２面
        code = "271004_001_35_01_01_001_001"
    elif num == "35":
        # ＨＳＴ西成スポーツセンター  第１体育場１／２面
        code = "271004_001_36_01_01_001_001"
    elif num == "36":
        # ＨＳＴ西成スポーツセンター  第２体育場
        code = "271004_001_36_02_01_002_001"
    elif num == "37":
        # ＨＳＴ扇町プール  体育場
        code = "271004_001_37_01_01_001_001"
    else:
        code = "-1"
    
    return code
